## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke-cinema.google_container_cluster.primary has changed
!   resource "google_container_cluster" "primary" {
        id                          = "projects/wayofthesys-cinema/locations/us-central1/clusters/cinema"
        name                        = "cinema"
        # (27 unchanged attributes hidden)

+       node_config {
+           disk_size_gb      = 10
+           disk_type         = "pd-standard"
+           guest_accelerator = []
+           image_type        = "COS_CONTAINERD"
+           labels            = {
+               "cluster_name" = "cinema"
+               "node_pool"    = "core"
            }
+           local_ssd_count   = 1
+           machine_type      = "c2d-highcpu-4"
+           metadata          = {
+               "cluster_name"             = "cinema"
+               "disable-legacy-endpoints" = "true"
+               "node_pool"                = "core"
            }
+           oauth_scopes      = [
+               "https://www.googleapis.com/auth/logging.write",
+               "https://www.googleapis.com/auth/monitoring",
            ]
+           preemptible       = true
+           service_account   = "terrateam-tf@wayofthesys-cinema.iam.gserviceaccount.com"
+           spot              = false
+           tags              = [
+               "gke-cinema",
+               "gke-cinema-core",
            ]
+           taint             = []

+           shielded_instance_config {
+               enable_integrity_monitoring = true
+               enable_secure_boot          = false
            }

+           workload_metadata_config {
+               mode = "GKE_METADATA"
            }
        }

+       node_pool {
+           initial_node_count          = 2
+           instance_group_urls         = [
+               "https://www.googleapis.com/compute/v1/projects/wayofthesys-cinema/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-8560d79c-grp",
            ]
+           managed_instance_group_urls = [
+               "https://www.googleapis.com/compute/v1/projects/wayofthesys-cinema/zones/us-central1-a/instanceGroups/gke-cinema-core-8560d79c-grp",
            ]
+           max_pods_per_node           = 65
+           name                        = "core"
+           node_count                  = 2
+           node_locations              = [
+               "us-central1-a",
            ]
+           version                     = "1.24.3-gke.2100"

+           autoscaling {
+               max_node_count       = 4
+               min_node_count       = 2
+               total_max_node_count = 0
+               total_min_node_count = 0
            }

+           management {
+               auto_repair  = true
+               auto_upgrade = true
            }

+           node_config {
+               disk_size_gb      = 10
+               disk_type         = "pd-standard"
+               guest_accelerator = []
+               image_type        = "COS_CONTAINERD"
+               labels            = {
+                   "cluster_name" = "cinema"
+                   "node_pool"    = "core"
                }
+               local_ssd_count   = 1
+               machine_type      = "c2d-highcpu-4"
+               metadata          = {
+                   "cluster_name"             = "cinema"
+                   "disable-legacy-endpoints" = "true"
+                   "node_pool"                = "core"
                }
+               oauth_scopes      = [
+                   "https://www.googleapis.com/auth/logging.write",
+                   "https://www.googleapis.com/auth/monitoring",
                ]
+               preemptible       = true
+               service_account   = "terrateam-tf@wayofthesys-cinema.iam.gserviceaccount.com"
+               spot              = false
+               tags              = [
+                   "gke-cinema",
+                   "gke-cinema-core",
                ]
+               taint             = []

+               shielded_instance_config {
+                   enable_integrity_monitoring = true
+                   enable_secure_boot          = false
                }

+               workload_metadata_config {
+                   mode = "GKE_METADATA"
                }
            }

+           upgrade_settings {
+               max_surge       = 1
+               max_unavailable = 0
            }
        }

        # (17 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_namespace.istio-system will be created
+   resource "kubernetes_namespace" "istio-system" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.asm.kubernetes_config_map.asm_options will be created
+   resource "kubernetes_config_map" "asm_options" {
+       data = {
+           "ASM_OPTS"          = "CNI=on"
+           "multicluster_mode" = "manual"
        }
+       id   = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "asm-options"
+           namespace        = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.asm.kubernetes_namespace.system will be created
+   resource "kubernetes_namespace" "system" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_command[0] will be created
+   resource "null_resource" "run_command" {
+       id       = (known after apply)
+       triggers = {
+           "arguments"             = "20da2117d1f42ce983e8b180ec9b17e0"
+           "create_cmd_body"       = "cinema us-central1 wayofthesys-cinema false false .terraform/modules/asm/modules/asm/scripts/create_cpr.sh asm-managed regular true false"
+           "create_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
+           "gcloud_bin_abs_path"   = "/google-cloud-sdk/bin"
+           "md5"                   = "a65cfbc45ca76efed4d2aa587cee9dc6"
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_destroy_command[0] will be created
+   resource "null_resource" "run_destroy_command" {
+       id       = (known after apply)
+       triggers = {
+           "destroy_cmd_body"       = "cinema us-central1 wayofthesys-cinema false false .terraform/modules/asm/modules/asm/scripts/destroy_cpr.sh asm-managed"
+           "destroy_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
+           "gcloud_bin_abs_path"    = "/google-cloud-sdk/bin"
        }
    }

Plan: 5 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
